---
kind: method
id: M:Autodesk.Revit.DB.IFC.ImporterIFC.ProcessIFCProject(Autodesk.Revit.DB.IFC.IFCAnyHandle,System.Collections.Generic.IDictionary{Autodesk.Revit.DB.IFC.IFCAnyHandle,Autodesk.Revit.DB.ElementId})
source: html/bf0ee7d6-d33b-d6a6-993d-f69d3dc583a6.htm
---
# Autodesk.Revit.DB.IFC.ImporterIFC.ProcessIFCProject Method

## Syntax (C#)
```csharp
public void ProcessIFCProject(
	IFCAnyHandle ifcProject,
	IDictionary<IFCAnyHandle, ElementId> createdElements
)
```

## Parameters
- **ifcProject** (`Autodesk.Revit.DB.IFC.IFCAnyHandle`)
- **createdElements** (`System.Collections.Generic.IDictionary < IFCAnyHandle , ElementId >`)